src/cf/InformationRegisters/CRM_ТекущиеЭтапыБизнесПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ТекущиеЭтапыБизнесПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Comment>Описание текущего этапа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ТекущиеЭтапыБизнесПроцессов/Ext/ManagerModule.bsl
Функция ТекущийЭтапБизнесПроцесса(БизнесПроцесс) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_ТекущиеЭтапыБизнесПроцессов.ТекущийЭтап КАК ТекущийЭтап
	|ИЗ
	|	РегистрСведений.CRM_ТекущиеЭтапыБизнесПроцессов КАК CRM_ТекущиеЭтапыБизнесПроцессов
	|ГДЕ
	|	CRM_ТекущиеЭтапыБизнесПроцессов.Объект = &БизнесПроцесс");
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекущийЭтап;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
